har-in-air/ESP32_IMU_BARO_GPS_VARIO/main/server/server.cpp
#include "Arduino.h"
#include <ESP32WebServer.h>    // https://github.com/Pedroalbuquerque/ESP32WebServer
#include "server.h"

// top level page handling, css and concept adapted from
// https://github.com/G6EJD/ESP32-ESP8266-File-Download-Upload-Delete-Stream-and-Directory

extern "C" {
#include "common.h"
#include "config.h"
#include "esp_vfs.h"
#include "esp_vfs_fat.h"
#include "spiffs_vfs.h"
#include "flashlog.h"
#include "spiflash.h"
#include "options.h"
}

#define TAG "server"

String webpage = "";

extern ESP32WebServer server;

static void server_appendHeader();
static void server_appendFooter();
static void server_sendHTMLStop();
static void server_sendHTMLContent();
static void server_sendHTMLHeader();
static void server_reportCouldNotCreateFile(String target);
static void server_reportFileNotFound(String target);
static void server_selectInput(String heading1, String command, String arg_calling_name);

static void server_spiffsFileDownload(String filename);
static void server_spiffsFileDelete(String filename);
static int server_fileSize(const char* fname);
static String server_fileSizeToString(int bytes);


void server_homePage(){
   server_sendHTMLHeader();
   webpage += F("<a href='/download'><button>Download</button></a>");
   webpage += F("<a href='/upload'><button>Upload</button></a>");
   webpage += F("<a href='/delete'><button>Delete</button></a>");
   webpage += F("<a href='/dir'><button>Directory</button></a>");
   server_appendFooter();
   server_sendHTMLContent();
   server_sendHTMLStop(); // Stop is needed because no content length was sent
   }


void server_listDir(){
   DIR *dir = NULL;
   struct dirent *ent;
   char type;
   char size[9];
   char tpath[100];
   struct stat sb;
   int statok;
#ifdef WEBCFG_DEBUG
   ESP_LOGI(TAG,"LIST of DIR [/spiffs/]\r\n");
#endif
   dir = opendir("/spiffs/");
   if (dir) {
      server_sendHTMLHeader();
      webpage += F("<center><h3 class='rcorners_m'>Directory Contents</h3></center><br>");
      webpage += F("<table align='center'>");
      webpage += F("<tr><th>Name</th><th>File Size</th></tr>");
      server_sendHTMLContent();
      while ((ent = readdir(dir)) != NULL) {
         if (webpage.length() > 1000) {
            server_sendHTMLContent();
            }
    	   sprintf(tpath, "/spiffs/");
         strcat(tpath, ent->d_name);
		   statok = stat(tpath, &sb);
			if (ent->d_type == DT_REG) {
				type = 'f';
				if (statok) {
               strcpy(size, "       ?");
               }
				else {
					if (sb.st_size < (1024*1024)) sprintf(size,"%8d", (int)sb.st_size);
					else if ((sb.st_size/1024) < (1024*1024)) sprintf(size,"%6dKB", (int)(sb.st_size / 1024));
					else sprintf(size,"%6dMB", (int)(sb.st_size / (1024 * 1024)));
				   }
			   }
			else {
				type = 'd';
				strcpy(size, "       -");
			   }
#ifdef WEBCFG_DEBUG
		   ESP_LOGI(TAG,"%c  %s  %s\r\n",type,size,ent->d_name);
#endif
         webpage += F("<tr><td>");
         if (type == 'd') webpage += F("(D) "); else webpage += F("(F) ");
         webpage += String(ent->d_name);
         webpage += F("</td><td>");
         webpage += String(size);
         webpage += F("</td></tr>");
         }
      webpage += F("</table>");
      server_sendHTMLContent();
      }
   else {
#ifdef WEBCFG_DEBUG
      ESP_LOGI(TAG,"Error opening directory");
#endif
      server_sendHTMLHeader();
      webpage += F("<h3>No Files Found</h3>");
      }
   closedir(dir);
   server_appendFooter();
   server_sendHTMLContent();
   server_sendHTMLStop();   // Stop is needed because no content length was sent
   }  


void server_fileUpload(){
   server_appendHeader();
   webpage += F("<h3>Select File to Upload</h3>"); 
   webpage += F("<FORM action='/fupload' method='post' enctype='multipart/form-data'>");
   webpage += F("<input class='buttons' style='width:40%' type='file' name='fupload' id = 'fupload' value=''><br>");
   webpage += F("<br><button class='buttons' style='width:10%' type='submit'>Upload File</button><br>");
   webpage += F("<a href='/'>[Back]</a><br><br>");
   server_appendFooter();
   server.send(200, "text/html",webpage);
   }


FILE* UploadFile;  // handleFileUpload called multiple times, so needs to be global

void server_handleFileUpload() {
   HTTPUpload&  httpupload = server.upload(); 
   if (httpupload.status == UPLOAD_FILE_START)  {
      String filename = httpupload.filename;
      if (!filename.startsWith("/spiffs/")) {
         filename = "/spiffs/"+filename;
         }
#ifdef WEBCFG_DEBUG
      ESP_LOGI(TAG,"Upload File Name: %s", filename.c_str());
#endif
      remove(filename.c_str()); // Remove any previous version 
      UploadFile = fopen(filename.c_str(), "wb");
      if (UploadFile == NULL) {
#ifdef WEBCFG_DEBUG
    	   ESP_LOGI(TAG,"Error opening file %s to write", filename.c_str());
#endif
    	   return;
         }
      filename = String();
      }
   else 
   if (httpupload.status == UPLOAD_FILE_WRITE) {
      if (UploadFile) {
		   int res = fwrite(httpupload.buf, 1, httpupload.currentSize, UploadFile);
		   if (res != httpupload.currentSize) {
#ifdef WEBCFG_DEBUG
	    	   ESP_LOGI(TAG,"Error writing to file %d <> %d", res, httpupload.currentSize);
#endif
		      }
         } 
      }
   else 
   if (httpupload.status == UPLOAD_FILE_END){
      if (UploadFile)  {                                    
         fclose(UploadFile);
#ifdef WEBCFG_DEBUG
         ESP_LOGI(TAG,"Upload Size: %d",httpupload.totalSize);
#endif
         webpage = "";
         server_appendHeader();
         webpage += F("<h3>File successfully uploaded</h3>"); 
         webpage += F("<h2>Uploaded File Name: "); webpage += httpupload.filename+"</h2>";
         webpage += F("<h2>File Size: "); webpage += server_fileSizeToString(httpupload.totalSize) + "</h2><br>"; 
         server_appendFooter();
         server.send(200,"text/html",webpage);
         } 
      else {
         server_reportCouldNotCreateFile("upload");
         }
      }
   }


// This gets called twice, the first pass selects the input, the second
// pass then processes the command line arguments

void server_fileDownload(){  
   if (server.args() > 0 ) { 
      if (server.hasArg("download")) {
         server_spiffsFileDownload(server.arg(0));
         }
      }
   else {
      server_selectInput("Enter filename to download","download","download");
      }
   }



void server_downloadDataLog() {
   if (FlashLogFreeAddress) {
      server.sendHeader("Content-Type", "application/octet-stream");
      server.sendHeader("Content-Disposition", "attachment; filename=datalog");
      server.sendHeader("Connection", "close");
      server.setContentLength(FlashLogFreeAddress);
      server.send(200, "application/octet-stream", "");

	   uint32_t flashAddr = 0;
      uint8_t buffer[256];
      int bytesRemaining = (int)(FlashLogFreeAddress - flashAddr);
      do {
         int numXmitBytes =  bytesRemaining > 256 ? 256 : bytesRemaining;  
		   spiflash_readBuffer(flashAddr, buffer, numXmitBytes);
         server.sendContent_P((const char*)buffer, numXmitBytes);
         flashAddr += numXmitBytes;
         bytesRemaining = (int)(FlashLogFreeAddress - flashAddr);
         delayMs(10);
		   } while (bytesRemaining >= 0);
	   }
   else {
      server_reportFileNotFound("datalog"); 
      }
   }


void server_fileDelete(){
   if (server.args() > 0 ) { 
      if (server.hasArg("delete")) {
         server_spiffsFileDelete(server.arg(0));
         }
      }
   else {
      server_selectInput("Select file to delete","delete","delete");
      }
   }


////////////////////////////////////////////////////////////////////////////////////

static void server_appendHeader() {
   webpage  = F("<!DOCTYPE html><html>");
   webpage += F("<head>");
   webpage += F("<title>ESP32 Gps Vario</title>"); // NOTE: 1em = 16px
   webpage += F("<meta name='viewport' content='user-scalable=yes,initial-scale=1.0,width=device-width'>");
   webpage += F("<style>");
   webpage += F("body{max-width:65%;margin:0 auto;font-family:arial;font-size:105%;text-align:center;color:blue;background-color:#F7F2Fd;}");
   webpage += F("ul{list-style-type:none;margin:0.1em;padding:0;border-radius:0.375em;overflow:hidden;background-color:#b79e64;font-size:1em;}");
   webpage += F("li{float:left;border-radius:0.375em;border-right:0.06em solid #bbb;}last-child {border-right:none;font-size:85%}");
   webpage += F("li a{display: block;border-radius:0.375em;padding:0.44em 0.44em;text-decoration:none;font-size:85%}");
   webpage += F("li a:hover{background-color:#f2cf7d;border-radius:0.375em;font-size:85%}");
   webpage += F("section {font-size:0.88em;}");
   webpage += F("h1{color:white;border-radius:0.5em;font-size:1em;padding:0.2em 0.2em;background:#558ED5;}");
   webpage += F("h2{color:orange;font-size:1.0em;}");
   webpage += F("h3{font-size:0.8em;}");
   webpage += F("table{font-family:arial,sans-serif;font-size:0.9em;border-collapse:collapse;width:85%;}"); 
   webpage += F("th,td {border:0.06em solid #dddddd;text-align:left;padding:0.3em;border-bottom:0.06em solid #dddddd;}"); 
   webpage += F("tr:nth-child(odd) {background-color:#eeeeee;}");
   webpage += F(".rcorners_n {border-radius:0.5em;background:#558ED5;padding:0.3em 0.3em;width:20%;color:white;font-size:75%;}");
   webpage += F(".rcorners_m {border-radius:0.5em;background:#558ED5;padding:0.3em 0.3em;width:50%;color:white;font-size:75%;}");
   webpage += F(".rcorners_w {border-radius:0.5em;background:#558ED5;padding:0.3em 0.3em;width:70%;color:white;font-size:75%;}");
   webpage += F(".column{float:left;width:50%;height:45%;}");
   webpage += F(".row:after{content:'';display:table;clear:both;}");
   webpage += F("*{box-sizing:border-box;}");
   webpage += F("footer{background-color:#dddd80; text-align:center;padding:0.3em 0.3em;border-radius:0.375em;font-size:60%;}");
   webpage += F("button{border-radius:0.5em;background:#558ED5;padding:0.3em 0.3em;width:20%;color:white;font-size:130%;}");
   webpage += F(".buttons {border-radius:0.5em;background:#558ED5;padding:0.3em 0.3em;width:15%;color:white;font-size:80%;}");
   webpage += F(".buttonsm{border-radius:0.5em;background:#558ED5;padding:0.3em 0.3em;width:9%; color:white;font-size:70%;}");
   webpage += F(".buttonm {border-radius:0.5em;background:#558ED5;padding:0.3em 0.3em;width:15%;color:white;font-size:70%;}");
   webpage += F(".buttonw {border-radius:0.5em;background:#558ED5;padding:0.3em 0.3em;width:40%;color:white;font-size:70%;}");
   webpage += F("a{font-size:75%;}");
   webpage += F("p{font-size:75%;}");
   webpage += F("</style></head><body><h1>ESP32 Gps Vario </h1>"); 
   }


static void server_appendFooter(){ 
   webpage += F("<ul>");
   webpage += F("<li><a href='/'>Home</a></li>"); // Lower Menu bar command entries
   webpage += F("<li><a href='/download'>Download</a></li>"); 
   webpage += F("<li><a href='/upload'>Upload</a></li>"); 
   webpage += F("<li><a href='/delete'>Delete</a></li>"); 
   webpage += F("<li><a href='/dir'>Directory</a></li>");
   webpage += F("</ul>");
   webpage += F("</body></html>");
   }


static void server_sendHTMLHeader(){
   server.sendHeader("Cache-Control", "no-cache, no-store, must-revalidate"); 
   server.sendHeader("Pragma", "no-cache"); 
   server.sendHeader("Expires", "-1"); 
   server.setContentLength(CONTENT_LENGTH_UNKNOWN); 
   server.send(200, "text/html", ""); // no Content-length header so we have to close the socket ourselves. 
   server_appendHeader();
   server.sendContent(webpage);
   webpage = "";
   }


static void server_sendHTMLContent(){
   server.sendContent(webpage);
   webpage = "";
   }


static void server_sendHTMLStop(){
   server.sendContent("");
   server.client().stop(); // Stop is needed because no content length was sent
   }



static void server_reportFileNotFound(String target){
   server_sendHTMLHeader();
   webpage += F("<h3>File does not exist</h3>"); 
   webpage += F("<a href='/"); 
   webpage += target + "'>[Back]</a><br><br>";
   server_appendFooter();
   server_sendHTMLContent();
   server_sendHTMLStop();
   }


static void server_reportCouldNotCreateFile(String target){
   server_sendHTMLHeader();
   webpage += F("<h3>Could Not Create Uploaded File (write-protected?)</h3>"); 
   webpage += F("<a href='/"); 
   webpage += target + "'>[Back]</a><br><br>";
   server_appendFooter();
   server_sendHTMLContent();
   server_sendHTMLStop();
   }


static void server_selectInput(String heading1, String command, String arg_calling_name){
   server_sendHTMLHeader();
   webpage += F("<h3>"); 
   webpage += heading1 + "</h3>"; 
   webpage += F("<FORM action='/"); 
   webpage += command + "' method='post'>"; // Must match the calling argument
   webpage += F("<input type='text' name='"); 
   webpage += arg_calling_name; 
   webpage += F("' value=''><br>");
   webpage += F("<type='submit' name='"); 
   webpage += arg_calling_name; 
   webpage += F("' value=''><br><br>");
   server_appendFooter();
   server_sendHTMLContent();
   server_sendHTMLStop();
   }


static int server_fileSize(const char* fname) {
   struct stat sb;
   int statok;
	statok = stat(fname, &sb);
   return (statok == 0) ? sb.st_size : -1;
   }


static String server_fileSizeToString(int bytes){
   String sz = "";
   if (bytes < 0)                    sz = "-?-";
   if (bytes < 1024)                 sz = String(bytes)+" B";
   else if(bytes < (1024*1024))      sz = String(bytes/1024.0,3)+" KB";
   return sz;
   }



static void server_spiffsFileDownload(String filename){
   String  fsname = "/spiffs/"+filename;
   FILE* fdDownload = fopen(fsname.c_str(), "r");
   if (fdDownload) {
      server.sendHeader("Content-Type", "text/text");
      server.sendHeader("Content-Disposition", "attachment; filename=" + filename);
      server.sendHeader("Connection", "close");
      int sizeBytes = server_fileSize(fsname.c_str());
      if (sizeBytes < 0) {
#ifdef WEBCFG_DEBUG
         ESP_LOGI(TAG,"Error file %s size bytes = -1", fsname.c_str());
#endif
         } 
      server.setContentLength(sizeBytes);
      server.send(200, "application/octet-stream", "");
      uint8_t buf[256];
      int numBytesToSend = sizeBytes;
      while(numBytesToSend > 0){
         int bytesRead = fread(buf, 1,256, fdDownload);
         server.sendContent_P((const char*)buf, bytesRead);
         numBytesToSend -= bytesRead;
         delayMs(10);
         }
      fclose(fdDownload);
      } 
   else {
      server_reportFileNotFound("download"); 
      }
   }



static void server_spiffsFileDelete(String filename) {
   server_sendHTMLHeader();
   String fsname = "/spiffs/" + filename;
   FILE* fd = fopen(fsname.c_str(), "r"); 
   if (fd)  {
      fclose(fd);
      remove(fsname.c_str());
#ifdef WEBCFG_DEBUG
      ESP_LOGI(TAG,"File deleted successfully");
#endif
      webpage += "<h3>File '" + filename + "' has been erased</h3>"; 
      webpage += F("<a href='/delete'>[Back]</a><br><br>");
      } 
   else {
      server_reportFileNotFound("delete");
      }
   server_appendFooter(); 
   server_sendHTMLContent();
   server_sendHTMLStop();
   }

